In [2]:
!pip install pandas

Collecting pandas
  Downloading pandas-2.2.3-cp310-cp310-win_amd64.whl.metadata (19 kB)
Requirement already satisfied: numpy>=1.22.4 in c:\users\adity\desktop\udemy ml dl\venv\lib\site-packages (from pandas) (2.2.2)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\users\adity\desktop\udemy ml dl\venv\lib\site-packages (from pandas) (2.9.0.post0)
Collecting pytz>=2020.1 (from pandas)
  Downloading pytz-2025.1-py2.py3-none-any.whl.metadata (22 kB)
Collecting tzdata>=2022.7 (from pandas)
  Using cached tzdata-2025.1-py2.py3-none-any.whl.metadata (1.4 kB)
Requirement already satisfied: six>=1.5 in c:\users\adity\desktop\udemy ml dl\venv\lib\site-packages (from python-dateutil>=2.8.2->pandas) (1.17.0)
Downloading pandas-2.2.3-cp310-cp310-win_amd64.whl (11.6 MB)
   ---------------------------------------- 0.0/11.6 MB ? eta -:--:--
    --------------------------------------- 0.3/11.6 MB ? eta -:--:--
   - -------------------------------------- 0.5/11.6 MB 1.5 MB/s eta 0:00:08
   --- ------------------------------------ 1.0/11.6 MB 1.7 MB/s eta 0:00:07
   ---- ----------------------------------- 1.3/11.6 MB 1.8 MB/s eta 0:00:06
   ------ --------------------------------- 1.8/11.6 MB 1.9 MB/s eta 0:00:06
   -------- ------------------------------- 2.4/11.6 MB 1.9 MB/s eta 0:00:05
   --------- ------------------------------ 2.9/11.6 MB 2.0 MB/s eta 0:00:05
   ----------- ---------------------------- 3.4/11.6 MB 2.1 MB/s eta 0:00:04
   ------------- -------------------------- 3.9/11.6 MB 2.1 MB/s eta 0:00:04
   --------------- ------------------------ 4.5/11.6 MB 2.2 MB/s eta 0:00:04
   ----------------- ---------------------- 5.0/11.6 MB 2.2 MB/s eta 0:00:03
   ------------------ --------------------- 5.2/11.6 MB 2.2 MB/s eta 0:00:03
   ------------------- -------------------- 5.8/11.6 MB 2.1 MB/s eta 0:00:03
   -------------------- ------------------- 6.0/11.6 MB 2.1 MB/s eta 0:00:03
   ---------------------- ----------------- 6.6/11.6 MB 2.1 MB/s eta 0:00:03
   ------------------------- -------------- 7.3/11.6 MB 2.2 MB/s eta 0:00:02
   -------------------------- ------------- 7.6/11.6 MB 2.2 MB/s eta 0:00:02
   ---------------------------- ----------- 8.4/11.6 MB 2.2 MB/s eta 0:00:02
   ------------------------------ --------- 8.9/11.6 MB 2.2 MB/s eta 0:00:02
   -------------------------------- ------- 9.4/11.6 MB 2.2 MB/s eta 0:00:01
   ---------------------------------- ----- 10.0/11.6 MB 2.2 MB/s eta 0:00:01
   ------------------------------------ --- 10.5/11.6 MB 2.3 MB/s eta 0:00:01
   ------------------------------------- -- 11.0/11.6 MB 2.2 MB/s eta 0:00:01
   -------------------------------------- - 11.3/11.6 MB 2.2 MB/s eta 0:00:01
   ---------------------------------------  11.5/11.6 MB 2.2 MB/s eta 0:00:01
   ---------------------------------------- 11.6/11.6 MB 2.1 MB/s eta 0:00:00
Downloading pytz-2025.1-py2.py3-none-any.whl (507 kB)
Using cached tzdata-2025.1-py2.py3-none-any.whl (346 kB)
Installing collected packages: pytz, tzdata, pandas
Successfully installed pandas-2.2.3 pytz-2025.1 tzdata-2025.1

In [15]:
import pandas as pd
import numpy as np

In [6]:
## Series - A Pandas Series is a one-dimensional array-like object that can hold any data type. 
# It is similar to a column in a table.

data = [1, 2, 3, 4, 5]
series = pd.Series(data)
print("Series \n", series)
print(type(series))

Series
 0    1
1    2
2    3
3    4
4    5
dtype: int64
<class 'pandas.core.series.Series'>

In [9]:
## Series from dictionary
data = {'a': 1, 'b': 2, 'c': 3}
series_dict = pd.Series(data)
print("Series using dictionary\n", series_dict)
series_keys = pd.Series(data.keys())
print("Series using Keys\n", series_keys)
series_values = pd.Series(data.values())
print("Series using Values\n", series_values)

Series using dictionary
 a    1
b    2
c    3
dtype: int64
Series using Keys
 0    a
1    b
2    c
dtype: object
Series using Values
 0    1
1    2
2    3
dtype: int64

In [10]:
# reindexing

data = [10, 20, 30]
index = ['a', 'b',  'c']

pd.Series(data, index=index)

a    10
b    20
c    30
dtype: int64

In [14]:
## Dataframe
## Create a Dataframe from a dictionary of list

data = {
    'Name': ["Adam", "Bob", "Charlie"],
    'Age': [25, 21, 24],
    'City': ['Delhi', 'Bangalore', 'Mumbai']
}

df = pd.DataFrame(data)
print(df)
print(type(df))

      Name  Age       City
0     Adam   25      Delhi
1      Bob   21  Bangalore
2  Charlie   24     Mumbai
<class 'pandas.core.frame.DataFrame'>

In [16]:
np.array(df)

array([['Adam', 25, 'Delhi'],
       ['Bob', 21, 'Bangalore'],
       ['Charlie', 24, 'Mumbai']], dtype=object)

In [18]:
# Create a list of Dictionary

data = [
    {'Name': "Adam", 'Age': 25, 'City': 'Delhi'},
    {'Name': "Bob", 'Age': 21, 'City': 'Banglore'},
    {'Name': "Charlie", 'Age': 24, 'City': 'Mumbai'}
]

In [19]:
df = pd.DataFrame(data)
print(df)

      Name  Age      City
0     Adam   25     Delhi
1      Bob   21  Banglore
2  Charlie   24    Mumbai

In [22]:
# Reas csv file

df = pd.read_csv('sales_data.csv')
print(df)

     Transaction ID        Date Product Category  \
0             10001  2024-01-01      Electronics
1             10002  2024-01-02  Home Appliances
2             10003  2024-01-03         Clothing
3             10004  2024-01-04            Books
4             10005  2024-01-05  Beauty Products
..              ...         ...              ...
235           10236  2024-08-23  Home Appliances
236           10237  2024-08-24         Clothing
237           10238  2024-08-25            Books
238           10239  2024-08-26  Beauty Products
239           10240  2024-08-27           Sports

                                        Product Name  Units Sold  Unit Price  \
0                                      iPhone 14 Pro           2      999.99
1                                   Dyson V11 Vacuum           1      499.99
2                                   Levi's 501 Jeans           3       69.99
3                                  The Da Vinci Code           4       15.99
4                            Neutrogena Skincare Set           1       89.99
..                                               ...         ...         ...
235  Nespresso Vertuo Next Coffee and Espresso Maker           1      159.99
236                        Nike Air Force 1 Sneakers           3       90.00
237           The Handmaid's Tale by Margaret Atwood           3       10.99
238             Sunday Riley Luna Sleeping Night Oil           1       55.00
239                       Yeti Rambler 20 oz Tumbler           2       29.99

     Total Revenue         Region Payment Method
0          1999.98  North America    Credit Card
1           499.99         Europe         PayPal
2           209.97           Asia     Debit Card
3            63.96  North America    Credit Card
4            89.99         Europe         PayPal
..             ...            ...            ...
235         159.99         Europe         PayPal
236         270.00           Asia     Debit Card
237          32.97  North America    Credit Card
238          55.00         Europe         PayPal
239          59.98           Asia    Credit Card

[240 rows x 9 columns]

In [23]:
df.head()

,Transaction ID,Date,Product Category,Product Name,Units Sold,Unit Price,Total Revenue,Region,Payment Method
0,10001,2024-01-01,Electronics,iPhone 14 Pro,2,999.99,1999.98,North America,Credit Card
1,10002,2024-01-02,Home Appliances,Dyson V11 Vacuum,1,499.99,499.99,Europe,PayPal
2,10003,2024-01-03,Clothing,Levi's 501 Jeans,3,69.99,209.97,Asia,Debit Card
3,10004,2024-01-04,Books,The Da Vinci Code,4,15.99,63.96,North America,Credit Card
4,10005,2024-01-05,Beauty Products,Neutrogena Skincare Set,1,89.99,89.99,Europe,PayPal

In [24]:
df.tail()

,Transaction ID,Date,Product Category,Product Name,Units Sold,Unit Price,Total Revenue,Region,Payment Method
235,10236,2024-08-23,Home Appliances,Nespresso Vertuo Next Coffee and Espresso Maker,1,159.99,159.99,Europe,PayPal
236,10237,2024-08-24,Clothing,Nike Air Force 1 Sneakers,3,90.00,270.00,Asia,Debit Card
237,10238,2024-08-25,Books,The Handmaid's Tale by Margaret Atwood,3,10.99,32.97,North America,Credit Card
238,10239,2024-08-26,Beauty Products,Sunday Riley Luna Sleeping Night Oil,1,55.00,55.00,Europe,PayPal
239,10240,2024-08-27,Sports,Yeti Rambler 20 oz Tumbler,2,29.99,59.98,Asia,Credit Card

In [ ]:
data = [
    {'Name': "Adam", 'Age': 25, 'City': 'Delhi'},
    {'Name': "Bob", 'Age': 21, 'City': 'Banglore'},
    {'Name': "Charlie", 'Age': 24, 'City': 'Mumbai'}
]

df = pd.DataFrame(data)
print(df)

      Name  Age      City
0     Adam   25     Delhi
1      Bob   21  Banglore
2  Charlie   24    Mumbai

In [29]:
## Accessing the data from dataframe

name = df['Name']
print(name)
print(type(name))

0       Adam
1        Bob
2    Charlie
Name: Name, dtype: object
<class 'pandas.core.series.Series'>

In [30]:
df.loc[0]

Name     Adam
Age        25
City    Delhi
Name: 0, dtype: object

In [32]:
df.iloc[0]

Name     Adam
Age        25
City    Delhi
Name: 0, dtype: object

In [33]:
df.iloc[0][0]

C:\Users\adity\AppData\Local\Temp\ipykernel_1716\2900375399.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  df.iloc[0][0]

'Adam'

In [ ]:
df

      Name  Age      City
0     Adam   25     Delhi
1      Bob   21  Banglore
2  Charlie   24    Mumbai

In [41]:
# Accessing a specified element
print(df.at[1, 'Age'])
print(df.at[2, 'Age'])
print(df.at[2, 'Name'])

21
24
Charlie

In [43]:
# Accessing a specific element using iat
print(df.iat[2, 2])
print(df.iat[0, 0])

Mumbai
Adam

In [47]:
df

      Name  Age      City  Salary
0     Adam   25     Delhi   22000
1      Bob   21  Banglore   21000
2  Charlie   24    Mumbai   23000

In [ ]:
# Data Manipulation with dataframe

# Adding a column
df['Salary'] = [22000, 21000, 23000]
df

      Name  Age      City  Salary
0     Adam   25     Delhi   22000
1      Bob   21  Banglore   21000
2  Charlie   24    Mumbai   23000

In [51]:
# Deleting a column
new_df = df.drop('City', axis=1)

In [50]:
df

      Name  Age      City  Salary
0     Adam   25     Delhi   22000
1      Bob   21  Banglore   21000
2  Charlie   24    Mumbai   23000

In [52]:
new_df

      Name  Age  Salary
0     Adam   25   22000
1      Bob   21   21000
2  Charlie   24   23000

In [53]:
df.drop('Salary', axis= 1, inplace=True)

In [54]:
df

      Name  Age      City
0     Adam   25     Delhi
1      Bob   21  Banglore
2  Charlie   24    Mumbai

In [55]:
## Add age to the column
df['Age'] = df['Age'] + 1

In [56]:
df

      Name  Age      City
0     Adam   26     Delhi
1      Bob   22  Banglore
2  Charlie   25    Mumbai

In [57]:
df.drop(0)

      Name  Age      City
1      Bob   22  Banglore
2  Charlie   25    Mumbai

In [58]:
df.drop(1, inplace=True)

In [59]:
df

      Name  Age    City
0     Adam   26   Delhi
2  Charlie   25  Mumbai